#+FILETAGS: :python:fluent_python:
#+STARTUP: content

**** Container sequences
- list, tuple, collections.deque
- each element is a reference to an object
  - each object has a header with metadata

#+begin_src python :results output
l = [[]] * 2
l[0].append(1)
print(l)
#+end_src

#+RESULTS:
: [[1], [1]]
    
